package com.rand.util;
import java.util.Random;

public class RandomTool {

	public static String getChineseName() {
		Random random = new Random(System.currentTimeMillis());
	    String[] Surname = {"赵","钱","孙","李","周","吴","郑","王",
	    "冯","陈","褚","卫","蒋","沈","韩","杨","朱","秦","尤","许",	
	    "何","吕","施","张","孔","曹","严","华","金","魏","陶","姜",
	    "戚","谢","邹","喻","柏","水","窦","章","云","苏","潘","葛",
	    "奚","范","彭","郎","鲁","韦","昌","马","苗","凤","花","方",
	    "俞","任","袁","柳","酆","鲍","史","唐","费","廉","岑","薛",
	    "雷","贺","倪","汤","滕","殷","罗","毕","郝","邬","安","常",
	    "乐","于","时","傅","皮","卞","齐","康","伍","余","元","卜",
	    "顾","孟","平","黄","和","穆","萧","尹","姚","邵","湛","汪",
	    "祁","毛","禹","狄","米","贝","明","臧","计","伏","成","戴",
	    "谈","宋","茅","庞","熊","纪","舒","屈","项","祝","董","梁",
	    "杜","阮","蓝","闵","席","季","麻","强","贾","路","娄","危",
	    "江","童","颜","郭","梅","盛","林","刁","钟","徐","邱","骆",
	    "高","夏","蔡","田","樊","胡","凌","霍","虞","万","支","柯",
	    "昝","管","卢","莫","经","房","裘","缪","干","解","应","宗",
	    "丁","宣","贲","邓","郁","单","杭","洪","包","诸","左","石",
	    "崔","吉","钮","龚","程","嵇","邢","滑","裴","陆","荣","翁",
	    "荀","羊","于","惠","甄","曲","家","封","芮","羿","储","靳",
	    "汲","邴","糜","松","井","段","富","巫","乌","焦","巴","弓",
	    "牧","隗","山","谷","车","侯","宓","蓬","全","郗","班","仰",
	    "秋","仲","伊","宫","宁","仇","栾","暴","甘","钭","厉","戎",
	    "祖","武","符","刘","景","詹","束","龙","叶","幸","司","韶",
	    "郜","黎","蓟","溥","印","宿","白","怀","蒲","邰","从","鄂",
	    "索","咸","籍","赖","卓","蔺","屠","蒙","池","乔","阴","郁",
	    "胥","能","苍","双","闻","莘","党","翟","谭","贡","劳","逄",
	    "姬","申","扶","堵","冉","宰","郦","雍","却","璩","桑","桂",
	    "濮","牛","寿","通","边","扈","燕","冀","浦","尚","农","温",
	    "别","庄","晏","柴","瞿","阎","充","慕","连","茹","习","艾"};
	    
	    String girl ="秀娟英华慧巧美娜静淑惠珠翠雅芝玉萍红娥玲芬芳"+
	    "燕彩春菊兰凤洁梅琳素云莲真环雪荣爱妹霞香月莺媛艳瑞凡佳嘉琼勤"+
	    "珍贞莉桂娣叶璧璐娅琦晶妍茜秋珊莎锦黛青倩婷姣婉娴瑾颖露瑶怡婵"+
	    "雁蓓纨仪荷丹蓉眉君琴蕊薇菁梦岚苑婕馨瑗琰韵融园艺咏卿聪澜纯毓"+
	    "悦昭冰爽琬茗羽希宁欣飘育滢馥筠柔竹霭凝晓欢霄枫芸菲寒伊亚宜可"+
	    "姬舒影荔枝思丽";
	    
	    String boy = "伟刚勇毅俊峰强军平保东文辉力明永健世广志义兴良"+
	    "海山仁波宁贵福生龙元全国胜学祥才发武新利清飞彬富顺信子杰涛昌"+
	   " 成康星光天达安岩中茂进林有坚和彪博诚先敬震振壮会思群豪心邦承"+
	    "乐绍功松善厚庆磊民友裕河哲江超浩亮政谦亨奇固之轮翰朗伯宏言若"+
	    "鸣朋斌梁栋维启克伦翔旭鹏泽晨辰士以建家致树炎德行时泰盛雄琛钧"+
	    "冠策腾楠榕风航弘";
	   
	    int index = random.nextInt(Surname.length - 1);
	    String firstName = Surname[index];
	    Boolean sex = random.nextBoolean();
	    String str = boy;
	    int length = boy.length();
	    if(sex){
	     // name_sex = "男";
	    }else{
	      str = girl;
	    //  name_sex="女";
	      length = girl.length();
	    }
	    index = random.nextInt(length - 1);
	    String secondName = str.substring(index, index + 1 );
	    Boolean hasThird = random.nextBoolean();
	    String thirdName = "";
	    if(hasThird)
	    {
	      index = random.nextInt(length - 1);
	      thirdName = str.substring(index, index + 1);
	    }
	    
	    return firstName + secondName + thirdName;
	}
	
	public static String getTelNumber() {
		String[] telfirst = "130,131,132,133,134,135,136,137,138,139,150,151,152,153,155,156,157,158,159".split(",");
	    Random random = new Random(System.currentTimeMillis());
	    int index = random.nextInt(telfirst.length - 1);
	    String firstNum = telfirst[index];
	    String secondPart = String.valueOf(random.nextInt(888) + 10000).substring(1);
	    String thirdPart = String.valueOf(random.nextInt(9100) + 10000).substring(1);
	  
	    return firstNum + secondPart + thirdPart;
	}
}
